<template>
	<view>
		<list title="转专业相关" :info="data"></list>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				data: [
					"1. 免笔试转专业:必修课平均学分绩点(简称平均绩点)在本专业前10%的，经本人申请，所在学院审核同意，可直接参加接收学院的考核",
					"2. 考试转专业平均绩点在本专业10%至40%之间的，经本人申请，所在学院审核同意，参加学校统-组织的笔试，通过笔试后可参加接收学院的考核。笔试根据报名具体情况另行通知",
					"3. 降级转专业:平均绩点在本专业40%之外或者40%之内未通过接收学院考核的学生，确实对原修读专业缺乏兴趣，对拟转专业又有一定特长，可申请降低一个年级转专业， 经双方学院同意后报教务处",
					"4. 转专业的考核和录取工作由接收学院负责，审核工作由教务处负责;为保障专业教学秩序和人员结构的稳定性，各专业转出学生人数一般不得超过2018年专业招生人数的10%，各学院可提前制定选拔方案并向学生公布，依据执行"
				]
			}
		},
		methods: {

		}
	}
</script>

<style>

</style>
