<template>
	<view>
		<list title="社团一览表(2018)"></list>
		<view style='border-left:1px solid #eee;border-top:1px solid #eee;background-color: #FFFFFF;'>
			<view class='line'>
				<view class='unit wilimt'>序号</view>
				<view class='unit '>社团名称</view>
				<view class='unit'>活动类型</view>
				<view class='unit'>指导单位</view>
			</view>
			<view v-for="(item,index) in data" :key="index" class='line'>
				<view class='unit wilimt'>{{item[0]}}</view>
				<view class='unit'>{{item[1]}}</view>
				<view class='unit'>{{item[2]}}</view>
				<view class='unit'>{{item[3]}}</view>
			</view>
		</view>
	</view>
</template>

<script>
	/**
	 * 处理脚本
	 */
	// $s = preg_replace("/[ ]+/", "','", $s);
	// $s = str_replace("\n", "'],['", $s);
	// $s = str_replace("\r", "", $s);
	// echo $s;
	export default {
		data() {
			return {
				data: [
					['1', '习近平新时代中国特色社会主义理论研究会', '社会主义理论讲座、实践交流', '校团委'],
					['2', '足球协会', '足球训练、比赛', '体育教研室'],
					['3', '北极星网络精英联合会', '网络维护、培训、比赛', '校团委'],
					['4', '羽毛球协会', '羽毛球比赛', '体育教研室'],
					['5', '棋艺协会', '棋艺培训、比赛', '校团委'],
					['6', '网络文明促进会', '互联网线上活动等', '校团委'],
					['7', '读书协会', '推进形成读书热潮', '图书馆'],
					['8', '花粉俱乐部', '综合性科技学习', '党委宣传部'],
					['9', '大学生思辨社', '辩论比赛、讲座', '矿业学院'],
					['10', '精武龙魂双节棍协会', '双节棍日常训练表演', '矿业学院'],
					['11', '梅花桩武术协会', '讲座、繁星练拳', '矿业学院'],
					['12', '行乐社', '乐器培训、开展音乐活动', '矿业学院'],
					['13', '杉树青年发展协会', '公益、大学助成', '矿业学院'],
					['14', '晨曦合唱团', '文艺演出', '地科学院'],
					['15', '地球科学协会', '地质技能专业技术培训、比赛', '地科学院'],
					['16', '魔方协会', '魔方比赛、魔方技巧的培养', '地科学院'],
					['17', '七大语社', '知识讲座、扩大小影响语种', '地科学院'],
					['18', '泊里红席非遗保护协会', '宣讲、设计比赛', '地科学院'],
					['19', '国旗护卫队', '升旗', '测绘学院'],
					['20', 'GIS地理信息系统协会', 'GIS专业技术讲座', '测绘学院'],
					['21', '测绘技能协会', '测量技能专业技术讲座、比赛', '测绘学院'],
					['22', '语言艺术协会', '推广普通话和规范字，提高演讲、朗诵、辩论水平', '测绘学院'],
					['23', 'T.O.S.悠悠球协会', '悠悠球培训、演出', '测绘学院'],
					['24', '遥感科学技术协会', '遥感专业技术培训、讲座', '测绘学院'],
					['25', '北斗星光创客空间', '卫星定位算法、计算机技术应用培训', '测绘学院'],
					['26', 'GEO地理协会', '探索地理文化、研究地理科学', '测绘学院'],
					['27', '航模协会', '航模技术培训', '测绘学院'],
					['28', '军事爱好者协会', '举办爱国活动、讲座', '土建学院'],
					['29', '建筑意协会', '组建培训班，外出写生', '土建学院'],
					['30', '大学生爱心社', '爱心服务', '土建学院'],
					['31', '土木工程研究会', '举办制作竞赛，组织讲座、交流会', '土建学院'],
					['32', '网球协会', '网球比赛、训练', '土建学院'],
					['33', 'BIM爱好者协会', 'BIM知识宣讲会，BIM培训授课', '土建学院'],
					['34', '匠心手艺协会', '手工制作技术培训', '土建学院'],
					['35', '跑吧协会', '集体跑操、跑步比赛', '土建学院'],
					['36', 'SAI健身社', '义务教学、科普知识', '土建学院'],
					['37', '机器人协会', '制作机器人,竞赛展览等', '机电学院'],
					['38', '乒乓球俱乐部', '组织乒乓球比赛', '机电学院'],
					['39', '工程图学研究会', '工程图技术培训、交流', '机电学院'],
					['40', '无极拳协会', '太极拳培训、表演', '机电学院'],
					['41', '三维数字化建模协会', '数字化建模培训', '机电学院'],
					['42', '乌托邦之梦台球交友协会', '台球技术交流', '机电学院'],
					['43', '“我们”滑板社', '滑板训练、比赛', '机电学院'],
					['44', '中医社', '研究、宣传养生之道', '机电学院'],
					['45', '晨星特教团', '志愿服务、公益', '机电学院'],
					['46', '678轮滑协会', '轮滑表演、培训', '计算机学院'],
					['47', '静语计算机协会', '多媒体教学、比赛', '计算机学院'],
					['48', '非凡映画影视协会', '摄影摄像知识', '讲座、社会实践', '计算机学院'],
					['49', '搏击联盟协会', '搏击武术训练、比赛、表演', '计算机学院'],
					['50', '星空魔术社', '魔术知识普及培训', '计算机学院'],
					['51', 'ACM编程协会', 'ACM知识讲座、比赛', '计算机学院'],
					['52', '漫画协会', '绘画手工创作', '计算机学院'],
					['53', '守一琴社', '文化传播', '计算机学院'],
					['54', '极客协会', '程序设计数据分析', '计算机学院'],
					['55', '数学与建模协会', '了解数学思维方法', '数学学院'],
					['56', '爱乐团', '教授吉他技能、普及音乐知识', '数学学院'],
					['57', '骐骥漂移板协会', '漂移板教学，日常练习，刷街活动', '数学学院'],
					['58', '蜜枣志愿服务队', '志愿服务、义务支教', '数学学院'],
					['59', '电子商务研究会', '参观、培训、创意管理比赛', '经管学院'],
					['60', '经贸学社', '学术研究、讲座', '经管学院'],
					['61', '大学生素质拓展中心', '素质拓展、举行活动', '经管学院'],
					['62', '会计协会', '会计知识研究、讲座、竞赛、调研', '经管学院'],
					['63', '金融菁英俱乐部', '举办金融讲座、知识竞赛', '经管学院'],
					['64', '远卓管理学社', '管理学讲座、社会实践', '经管学院'],
					['65', '财税协会', '思想交流活动、经济热点剖析', '经管学院'],
					['66', '山东科技大学', 'Beatbox协会', 'B-BOX表演技能培训', '经管学院'],
					['67', '物流协会', '物流讲座、活动', '经管学院'],
					['68', '破晓英语社', '组织英语演讲培训、举办英语演讲比赛', '经管学院'],
					['69', '大学生礼仪宣讲演示团', '礼仪宣讲演示', '经管学院'],
					['70', '疯狂英语协会', '室外晨读、室外讲座', '自动化学院'],
					['71', '电子电路实践社', '电子电路知识室内讲座、参观', '自动化学院'],
					['72', '围棋协会', '围棋问题室内讲座', '自动化学院'],
					['73', '夜跑&fun', 'run', '日常锻炼，荧光夜跑，主题夜跑', '自动化学院'],
					['74', '模拟从业社团', '开展就业、创业模拟活动', '自动化学院'],
					['75', 'SmartRobot机器人', '俱乐部', '推广机器人技术', '自动化学院'],
					['76', 'LabVIEW俱乐部', '开展虚拟仪器技术培训', '自动化学院'],
					['77', '智能汽车协会', '培训智能汽车技术', '自动化学院'],
					['78', '星雨吉他协会', '吉他表演、培训', '电子学院'],
					['79', 'N.O.B.街舞协会', '街舞训练、表演', '电子学院'],
					['80', '书画协会', '书画培训学习', '电子学院'],
					['81', '芯科电子协会', '举办大学生电子设计大赛预选赛，准备比赛硬件', '电子学院'],
					['82', 'FTF桌友社', '交流桌游', '电子学院'],
					['83', '绿色使者协会', '环保宣传、公益活动', '化工学院'],
					['84', 'S.K.S曳步舞协会', '社会实践活动、培训、演出', '化工学院'],
					['85', '化学技能协会', '化学知识讲解，趣味化学魔术实验，化学知识竞赛', '化工学院'],
					['86', 'DIY手工协会', '技能学习培训，作品创新', '化工学院'],
					['87', '刀下飞花剪纸社', '剪纸技术培训', '化工学院'],
					['88', '零度灵都配音社', '影视配音培训、比赛', '化工学院'],
					['89', '热风学社', '举办学者讲座、社会实践', '材料学院'],
					['90', '图书银行', '培养学生读书习惯提供读书便利', '材料学院'],
					['91', '篮球协会', '组织篮球集训、开展篮球比赛', '材料学院'],
					['92', '艺云社', '戏曲表演培训', '材料学院'],
					['93', '笔工协会', '手写、绘画与设计', '材料学院'],
					['94', '滴胶社', '滴胶培训、比赛与爱心义卖', '材料学院'],
					['95', '古云印社', '书法、篆刻培训，作品交流会', '交通学院'],
					['96', '机械制图协会', '提升制图和计算机绘图能力', '交通学院'],
					['97', '陶笛协会', '陶笛培训、学习', '交通学院'],
					['98', '望岳诗社', '诗歌写作、诗歌朗诵', '文法学院'],
					['99', '法协会', '法制宣传、模拟法庭', '文法学院'],
					['100', '交谊舞协会', '交谊舞学习', '文法学院'],
					['101', '星火公益协会', '寒、暑期支教', '文法学院'],
					['102', '国学社', '读书沙龙、讲座、参访和旅游', '文法学院'],
					['103', '国际汉语传播协会', '传播汉语言文学', '文法学院'],
					['104', '外文剧团', '话剧沙龙、公演、电影、晚会', '外国语学院'],
					['105', '英语协会', '英语角、英语沙龙、晚会', '外国语学院'],
					['106', 'CUBA科大篮球宝贝协会', '健美操训练，选拔篮球宝贝', '外国语学院'],
					['107', '韩语协会', '韩语学习、交流、知识竞赛', '外国语学院'],
					['108', '日语协会', '日语培训学习', '外国语学院'],
					['109', '萤火公益助学团队', '志愿服务、爱心捐赠、公益助学', '外国语学院'],
					['110', 'CP动漫社', '讲座、动漫制作、动漫个人表演', '艺术学院'],
					['111', '摄影协会', '开发学生对摄影的能力和兴趣', '艺术学院'],
					['112', '大学生话剧团', '普及戏剧艺术，推广戏剧文化', '艺术学院'],
					['113', '大学生发展研究社', '调研大学生发展情况，研究大学生就业创业', '艺术学院'],
					['114', '艺匠', '创意绘画训练、比赛', '艺术学院'],
					['115', '篮球裁判协会', '培养裁判人才、裁判知识普及', '体育学院']
				]
			}
		},
		methods: {

		}
	}
</script>

<style>
	.line {
		display: flex;
	}

	.unit {
		box-sizing: border-box;
		width: 30%;
		padding: 15px 5px;
		text-align: center;
		border-bottom: 1px solid #eee;
		border-right: 1px solid #eee;
		display: flex;
		justify-content: center;
		align-items: center;
	}

	.wilimt {
		width: 10%;
	}
</style>
