<template>
	<view>
		<list title="常用缴费" :info="data"></list>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				data: [
					"1. 饭卡充值可直接使用支付宝，搜索校园生活(菜单栏也有)，选择一卡通绑定校园卡以后即可缴费，充值后并不会立即到账，直到下次刷卡消费时才会充值到校园卡",
					"2. 水卡办理：携带校园卡去C区C3楼下即可办理，往年办理水卡不能使用校园卡的钱，需要使用支付宝或微信支付",
					"3. 水卡充值：除了办理水卡的地方可以充值外，在A餐三楼与田园超市二楼书店都可以充值",
					"4. 公交卡充值：手机有NFC功能可以选择直接在手机充值，在A餐三楼与水卡充值相同的地方也可以充值公交卡，每次需支付一元手续费",
					"5. 电费充值：一元两度电，充电地点：大活208，时间：16:10-17:00"
				]
			}
		},
		methods: {

		}
	}
</script>

<style>

</style>
