<template>
	<view>
		<list title="上课时间" :info="classData"></list>
		<list title="作息时间" :info="sleepData"></list>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				classData: [
					"第12节 8:00 - 9:50 ",
					"第34节 10:10 - 12:00",
					"第56节 14:00 - 15:50",
					"第78节 16:00 - 17:50",
					"第9X节 19:00 - 20:50",
					"注:J14一般78节中间休息时间不休息，然后提早下课",
				],
				sleepData: [
					"起床:跑操6:20(部分学院) 交操卡6:40",
					"上午: 8:00 - 12:00",
					"午间: 12:00 - 13:40",
					"下午: 14:00 - 17:50",
					"晚间: 19:00 - 21:00",
					"断电: 22:30 (周六 24:00)",
					"宿舍楼关闭: 23:00 (周六 23:30)",
					"注:1. 7月份左右由于太热晚间不断电，但需要按时熄灯",
					"2. 自2019年开始全年统一作息时间，不再执行夏季作息时间"
				]
			}
		},
		methods: {

		}
	}
</script>

<style>

</style>
