<template>
	<view>
		<list title="来校路线" :info="data"></list>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				data:[
				      "1. 从青岛火车站到学校 \n 从青岛火车站东出站口出站，步行前往兰山路火车站公交站牌(可从青岛站走地下通道到地铁G号口出站)： \n  \t直达线路：乘坐隧道1路车到山东科技大学站南门下车 \n \t转车线路：乘坐隧道3路车到黄岛长途站下车，剩余路程参照 3.黄岛长途汽车站 \n 此外，学校在报到当天在青岛火车站有迎新车辆(一般在火车站旅游汽车站那边的地下过街通道出口附近)",
				      "2. 从青岛北站到学校 \n 在北站乘坐地铁到青岛站然后G出站口出站，转乘隧道1路或隧道3路。剩下路程参照 1.青岛火车站",
				      "3. 从黄岛长途汽车站到学校 \n 乘坐开发区公交9路到科技大学站下车，到达学校南门(南门有迎新) \n 乘坐6路到科技大学北站下车，到达学校北门",
				      "4. 流亭机场 - 山科南门 \n 路线1：乘坐机场巴士到青岛站，在乘坐学校报到当天的迎新车辆 \n 路线2：机场巴士黄岛(705路)专线在保税区公交站下，步行到保税港区西门公交站坐东9路(龙湖原山方向)到科技大学南门下车 \n 路线3：机场2线(702路)在市立医院公交站下车换乘隧道1路直达科技大学南门"
				    ]
			}
		},
		methods: {

		}
	}
</script>

<style>

</style>
