<template>
	<view>
		<list title="快递相关" :info="data"></list>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				data: [
					"1. 百世快递：科大A区中心浴室西顺丰二楼",
					"2. 中通快递：科大南门青岛银行西中通营业厅，山科C区维客超市东门美食屋",
					"3. 京东快递：科大A区中心浴室西京东派",
					"4. 圆通快递：山科A区大活西门103室菜鸟驿站，山科C区学术宾馆西侧菜鸟驿站",
					"5. 韵达快递：科大A区中心浴室西顺丰二楼",
					"6. 天天快递：科大南门青岛银行西天天快递",
					"7. 申通快递：山科大A区浴室西侧网点菜鸟驿站",
					"8. 顺丰快递：科大A区中心浴室西"
				]
			}
		},
		methods: {

		}
	}
</script>

<style>

</style>
